In [3]:
import pandas as pd
import itertools

In [12]:
df = pd.DataFrame(list(itertools.product(range(3), range(3))))
df.columns = "x,y".split(",")
df

   x  y
0  0  0
1  0  1
2  0  2
3  1  0
4  1  1
5  1  2
6  2  0
7  2  1
8  2  2

In [14]:
df.groupby("x").cumsum()

   y
0  0
1  1
2  3
3  0
4  1
5  3
6  0
7  1
8  3

cumsumはあるぽい。順番が変わったらどうなるか

In [16]:
df2 = pd.DataFrame([
    [0, 2, 0],
    [0, 1, 1],
    [0, 0, 2]
])
df2.columns = "x,y,z".split(",")
df2

   x  y  z
0  0  2  0
1  0  1  1
2  0  0  2

In [17]:
df2.groupby("x").cumsum()

   y  z
0  2  0
1  3  1
2  3  3

In [21]:
df2.sort_values(["x", "y"]).groupby("x").cumsum()

   y  z
2  0  2
1  1  3
0  3  3

In [24]:
help(df2.groupby("x").cumsum)

Help on method cumsum in module pandas.core.groupby.groupby:

cumsum(axis=0, *args, **kwargs) method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Cumulative sum for each group.

    Returns
    -------
    Series or DataFrame

    See Also
    --------
    Series.groupby : Apply a function groupby to a Series.
    DataFrame.groupby : Apply a function groupby
        to each row or column of a DataFrame.